<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>This recipe downloads latest LibreOffice and the language pack of the specified language.</string>
	<key>Identifier</key>
	<string>ch.edu-vd.cipeo.download.libreoffice</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LibreOffice</string>
		<key>LANGUAGE_CODE</key>
		<string>fr</string>
		<key>RELEASE</key>
		<string>Latest</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>LibreOffice (?P&lt;smallversion&gt;\d+\.\d+)(\.\d+)? [^ ]+ - %RELEASE% Release</string>
				<key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
				<key>url</key>
				<string>https://www.libreoffice.org/download/release-notes/</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>LibreOffice (?P&lt;version&gt;%smallversion%\.\d+) release notes</string>
				<key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
				<key>url</key>
				<string>https://www.libreoffice.org/download/download/</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://download.documentfoundation.org/libreoffice/stable/%version%/mac/x86_64/LibreOffice_%version%_MacOS_x86-64_langpack_%LANGUAGE_CODE%.dmg</string>
                <key>CHECK_FILESIZE_ONLY</key>
                <true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://download.documentfoundation.org/libreoffice/stable/%version%/mac/x86_64/LibreOffice_%version%_MacOS_x86-64.dmg</string>
                <key>CHECK_FILESIZE_ONLY</key>
                <true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/LibreOffice.app</string>
				<key>requirement</key>
				<string>(identifier "org.libreoffice.script.LibreOffice" or identifier "org.libreoffice.script") and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7P5S3ZLCN7"</string>
				<key>strict_verification</key>
				<true />
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
			    <key>source_path</key>
			    <string>%RECIPE_CACHE_DIR%/downloads/LibreOffice_%version%_MacOS_x86-64.dmg/LibreOffice.app</string>
	            <key>destination_path</key>
	            <string>%RECIPE_CACHE_DIR%/downloads/LibreOffice.app</string>
	            <key>overwrite</key>
	            <true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
			    <key>source_path</key>
			    <string>%RECIPE_CACHE_DIR%/downloads/LibreOffice_%version%_MacOS_x86-64_langpack_%LANGUAGE_CODE%.dmg/LibreOffice Language Pack.app</string>
	            <key>destination_path</key>
	            <string>%RECIPE_CACHE_DIR%/downloads/LibreOffice-LanguagePack.app</string>
	            <key>overwrite</key>
	            <true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/LibreOffice.app</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%INSTALL_DIR%/LibreOffice.app</string>
	            <key>overwrite</key>
	            <true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-LanguagePack.app/**/tarball.tar.bz2</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%found_filename%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%INSTALL_DIR%/LibreOffice.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>