<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Create package for GoogleEarthPro</string>
    <key>Identifier</key>
    <string>ch.edu-vd.cipeo.pkg.GoogleEarthPro</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoogleEarthPro</string>
        <key>VERSIONTYPE</key>
        <string>CFBundleVersion</string>
    </dict>
    <key>ParentRecipe</key>
    <string>ch.edu-vd.cipeo.download.GoogleEarthPro</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%/*Earth Pro*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Google_Earth_Pro.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>PlistReader</string>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
			    <string>%RECIPE_CACHE_DIR%/payload/Google Earth Pro.app/Contents/info.plist</string>
			    <key>plist_keys</key>
			    <dict>
			        <key>CFBundleIdentifier</key>
			        <string>bundle_identifier</string>
					<key>LSMinimumSystemVersion</key>
					<string>minimum_version</string>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
				</dict>
			</dict>
		</dict>
		<dict>
		    <key>Processor</key>
		    <string>StopProcessingIf</string>
		    <key>Arguments</key>
		    <dict>
		        <key>predicate</key>
		        <string>version_exists == TRUE</string>
		    </dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.adrienpi.SharedProcessors/GetUserHome</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/*Earth Pro*.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/GoogleEarthPro-%version%.pkg</string>
            </dict>
             <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
		<dict>
        	<key>Processor</key>
        	<string>Copier</string>
        	<key>Arguments</key>
        	<dict>
				<key>source_path</key>
				<string>%pkg_path%</string>
				<key>destination_path</key>
				<string>/Users/%current_user%/Desktop/packagesupload/</string>
			</dict>
		</dict>
		<dict>
        	<key>Processor</key>
        	<string>com.github.adrienpi.SharedProcessors/CSVWriter_titleeditor</string>
        	<key>Arguments</key>
        	<dict>
				<key>app_name</key>
				<string>%NAME%-%version%.pkg</string>
				<key>app_version</key>
				<string>%version%</string>
				<key>category</key>
				<string>Géographie</string>
				<key>softwaretitle_name</key>
				<string>Google Earth Pro</string>
				<key>app_minimum_version</key>
				<string>%minimum_version%</string>
				<key>bundle_identifier</key>
				<string>%bundle_identifier%</string>
			</dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/*Earth Pro*.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/GoogleEarthPro-latest.pkg</string>
            </dict>
             <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
		<dict>
        	<key>Processor</key>
        	<string>Copier</string>
        	<key>Arguments</key>
        	<dict>
				<key>source_path</key>
				<string>%pkg_path%</string>
				<key>destination_path</key>
				<string>/Users/%current_user%/Desktop/packagesupload/</string>
			</dict>
		</dict>
		<dict>
        	<key>Processor</key>
        	<string>com.github.adrienpi.SharedProcessors/CSVWriter_titleeditor</string>
        	<key>Arguments</key>
        	<dict>
				<key>app_name</key>
				<string>%NAME%-latest.pkg</string>
				<key>app_version</key>
				<string>%version%</string>
				<key>category</key>
				<string>Géographie</string>
				<key>softwaretitle_name</key>
				<string>Google Earth Pro</string>
				<key>app_minimum_version</key>
				<string>%minimum_version%</string>
				<key>bundle_identifier</key>
				<string>%bundle_identifier%</string>
			</dict>
		</dict>
        <dict>
           <key>Processor</key>
           <string>PathDeleter</string>
           <key>Arguments</key>
           <dict>
              <key>path_list</key>
              <array>
                 <string>%RECIPE_CACHE_DIR%/unpack</string>
                 <string>%RECIPE_CACHE_DIR%/payload</string>
              </array>
           </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>com.github.adrienpi.SharedProcessors/TeamsNotification</string>
		</dict>
    </array>
</dict>
</plist>
