<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Create custom package for SupportIT by RootNL3</string>
    <key>Identifier</key>
    <string>ch.edu-vd.cipeo.pkg.supportit</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SupportIT</string>
    </dict>
    <key>ParentRecipe</key>
    <string>ch.edu-vd.cipeo.download.supportit</string>
    <key>Process</key>
    <array>
        <dict>
           <key>Arguments</key>
           <dict>
              <key>destination_path</key>
              <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
              <key>flat_pkg_path</key>
              <string>%pathname%</string>
           </dict>
           <key>Processor</key>
           <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
           <key>Arguments</key>
           <dict>
              <key>pattern</key>
              <string>%RECIPE_CACHE_DIR%/downloads/unpack/*Support*.pkg</string>
           </dict>
           <key>Processor</key>
           <string>FileFinder</string>
        </dict>
        <dict>
           <key>Arguments</key>
           <dict>
              <key>destination_path</key>
              <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
              <key>pkg_payload_path</key>
              <string>%found_filename%/Payload</string>
           </dict>
           <key>Processor</key>
           <string>PkgPayloadUnpacker</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>PlistReader</string>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
			    <string>%RECIPE_CACHE_DIR%/downloads/payload/Support.app/Contents/Info.plist</string>
			    <key>plist_keys</key>
			    <dict>
			        <key>CFBundleIdentifier</key>
			        <string>bundle_identifier</string>
					<key>LSMinimumSystemVersion</key>
					<string>minimum_version</string>
				</dict>
			</dict>
		</dict>
	    <dict>
        	<key>Processor</key>
        	<string>Copier</string>
        	<key>Arguments</key>
        	<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/payload/Support.app</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Support.app</string>
				<key>overwrite</key>
				<string>True</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.adrienpi.SharedProcessors/VersionCheck</string>
			<key>Arguments</key>
			<dict>
			    <key>version</key>
			    <string>%version%</string>
			    <key>pkg_path</key>
			    <string>%RECIPE_CACHE_DIR%</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>id</key>
                    <string>ch.edu-vd.cipeo.pkg.supportit</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>scripts</key>
                    <string>%RECIPE_CACHE_DIR%/scripts</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>

        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>version_exists == TRUE</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>com.github.adrienpi.SharedProcessors/GetUserHome</string>
		</dict>
		<dict>
           <key>Processor</key>
           <string>PkgCopier</string>
           <key>Arguments</key>
           <dict>
              <key>source_pkg</key>
              <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
              <key>pkg_path</key>
              <string>/Users/%current_user%/Desktop/packagesupload/%NAME%-latest.pkg</string>
           </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>PkgCopier</string>
           <key>Arguments</key>
           <dict>
              <key>source_pkg</key>
              <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
              <key>pkg_path</key>
              <string>/Users/%current_user%/Desktop/packagesupload/%NAME%-%version%.pkg</string>
           </dict>
        </dict>
		<dict>
        	<key>Processor</key>
        	<string>com.github.adrienpi.SharedProcessors/CSVWriter_titleeditor</string>
        	<key>Arguments</key>
        	<dict>
				<key>app_name</key>
				<string>%NAME%-%version%.pkg</string>
				<key>app_version</key>
				<string>%version%</string>
				<key>category</key>
				<string>Utilitaires</string>
				<key>softwaretitle_name</key>
				<string>SupportIT</string>
				<key>app_minimum_version</key>
				<string>%minimum_version%</string>
				<key>bundle_identifier</key>
				<string>%bundle_identifier%</string>
			</dict>
		</dict>
		<dict>
        	<key>Processor</key>
        	<string>com.github.adrienpi.SharedProcessors/CSVWriter_titleeditor</string>
        	<key>Arguments</key>
        	<dict>
				<key>app_name</key>
				<string>%NAME%-latest.pkg</string>
				<key>app_version</key>
				<string>%version%</string>
				<key>category</key>
				<string>Utilitaires</string>
				<key>softwaretitle_name</key>
				<string>SupportIT</string>
				<key>app_minimum_version</key>
				<string>%minimum_version%</string>
				<key>bundle_identifier</key>
				<string>%bundle_identifier%</string>
			</dict>
		</dict>
		<dict>
           <key>Processor</key>
           <string>PathDeleter</string>
           <key>Arguments</key>
           <dict>
              <key>path_list</key>
              <array>
                 <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
                 <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
                 <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Support.app</string>
              </array>
           </dict>
        </dict>
        <dict>
			<key>Processor</key>
			<string>com.github.adrienpi.SharedProcessors/TeamsNotification</string>
		</dict>
    </array>
</dict>
</plist>
