<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Rename package Microsoft Teams work or school</string>
    <key>Identifier</key>
    <string>ch.edu-vd.cipeo.pkg.MicrosoftTeamsWorkOrSchool</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Microsoft Teams</string>
        <key>VENDOR</key>
        <string>Microsoft</string>
        <key>SOFTWARETITLE1</key>
        <string>Teams</string>
        <key>SOFTWARETITLE2</key>
        <string>(work or school)</string>
        <key>VERSIONTYPE</key>
        <string>CFBundleShortVersionString</string>
    </dict>
    <key>ParentRecipe</key>
    <string>ch.edu-vd.cipeo.download.MicrosoftTeamsWorkOrSchool</string>
    <key>Process</key>
    <array>
        <dict>
           <key>Arguments</key>
           <dict>
              <key>destination_path</key>
              <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
              <key>flat_pkg_path</key>
              <string>%pathname%</string>
           </dict>
           <key>Processor</key>
           <string>FlatPkgUnpacker</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>PlistReader</string>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
			    <string>%pathname%/%app_name%/Contents/info.plist</string>
			    <key>plist_keys</key>
			    <dict>
			        <key>CFBundleIdentifier</key>
			        <string>bundle_identifier</string>
					<key>LSMinimumSystemVersion</key>
					<string>minimum_version</string>
				</dict>
			</dict>
		</dict>
        <dict>
           <key>Arguments</key>
           <dict>
              <key>pattern</key>
              <string>%RECIPE_CACHE_DIR%/downloads/unpack/*Teams*.pkg</string>
           </dict>
           <key>Processor</key>
           <string>FileFinder</string>
        </dict>
        <dict>
           <key>Arguments</key>
           <dict>
              <key>destination_path</key>
              <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
              <key>pkg_payload_path</key>
              <string>%found_filename%/Payload</string>
           </dict>
           <key>Processor</key>
           <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
           <key>Arguments</key>
           <dict>
              <key>input_plist_path</key>
              <string>%RECIPE_CACHE_DIR%/downloads/payload/Microsoft Teams.app/Contents/Info.plist</string>
              <key>plist_version_key</key>
              <string>%VERSIONTYPE%</string>
           </dict>
           <key>Processor</key>
           <string>Versioner</string>
        </dict>
        <dict>
           <key>Processor</key>
           <string>PathDeleter</string>
           <key>Arguments</key>
           <dict>
              <key>path_list</key>
              <array>
                 <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
                 <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
              </array>
           </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>com.github.adrienpi.SharedProcessors/VersionCheck</string>
			<key>Arguments</key>
			<dict>
			    <key>version</key>
			    <string>%version%</string>
			    <key>pkg_path</key>
			    <string>%RECIPE_CACHE_DIR%</string>
			</dict>
		</dict>
		<dict>
		    <key>Processor</key>
		    <string>StopProcessingIf</string>
		    <key>Arguments</key>
		    <dict>
		        <key>predicate</key>
		        <string>version_exists == True</string>
		    </dict>
		</dict>
        <dict>
           <key>Processor</key>
           <string>PkgCopier</string>
           <key>Arguments</key>
           <dict>
              <key>source_pkg</key>
              <string>%pathname%</string>
              <key>pkg_path</key>
              <string>%RECIPE_CACHE_DIR%/%VENDOR%%SOFTWARETITLE1%%SOFTWARETITLE2%-%version%.pkg</string>
           </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>com.github.adrienpi.SharedProcessors/GetUserHome</string>
		</dict>
		<dict>
        	<key>Processor</key>
        	<string>Copier</string>
        	<key>Arguments</key>
        	<dict>
				<key>source_path</key>
				<string>%pkg_path%</string>
				<key>destination_path</key>
				<string>/Users/%current_user%/Desktop/packagesupload/</string>
			</dict>
		</dict>
		<dict>
        	<key>Processor</key>
        	<string>com.github.adrienpi.SharedProcessors/CSVWriter_titleeditor</string>
        	<key>Arguments</key>
        	<dict>
				<key>app_name</key>
				<string>%VENDOR%%SOFTWARETITLE1%%SOFTWARETITLE2%-%version%.pkg</string>
				<key>app_version</key>
				<string>%version%</string>
				<key>category</key>
				<string>Bureautique</string>
				<key>softwaretitle_name</key>
				<string>Microsoft Teams (work or school)</string>
				<key>app_minimum_version</key>
				<string>%minimum_version%</string>
				<key>bundle_identifier</key>
				<string>%bundle_identifier%</string>
			</dict>
		</dict>
        <dict>
           <key>Processor</key>
           <string>PkgCopier</string>
           <key>Arguments</key>
           <dict>
              <key>source_pkg</key>
              <string>%pathname%</string>
              <key>pkg_path</key>
              <string>%RECIPE_CACHE_DIR%/%VENDOR%%SOFTWARETITLE1%%SOFTWARETITLE2%-latest.pkg</string>
           </dict>
        </dict>
		<dict>
        	<key>Processor</key>
        	<string>Copier</string>
        	<key>Arguments</key>
        	<dict>
				<key>source_path</key>
				<string>%pkg_path%</string>
				<key>destination_path</key>
				<string>/Users/%current_user%/Desktop/packagesupload/</string>
			</dict>
		</dict>
		<dict>
        	<key>Processor</key>
        	<string>com.github.adrienpi.SharedProcessors/CSVWriter_titleeditor</string>
        	<key>Arguments</key>
        	<dict>
				<key>app_name</key>
				<string>%VENDOR%%SOFTWARETITLE1%%SOFTWARETITLE2%-latest.pkg</string>
				<key>app_version</key>
				<string>%version%</string>
				<key>category</key>
				<string>Bureautique</string>
				<key>softwaretitle_name</key>
				<string>Microsoft Teams (work or school)</string>
				<key>app_minimum_version</key>
				<string>%minimum_version%</string>
				<key>bundle_identifier</key>
				<string>%bundle_identifier%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.adrienpi.SharedProcessors/TeamsNotification</string>
			<key>Arguments</key>
			<dict>
				<key>webhook_url</key>
				<string>https://eduvd.webhook.office.com/webhookb2/f598187a-f841-4681-80a8-05efff1db653@eb604481-2c81-4bbe-a1ca-94ba812a78d0/IncomingWebhook/18a2c28c8e10499193a061050434569b/4748d0f8-2b4a-4790-9253-8990250b7d1f</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>
