<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Adobe Reader DC disk image and builds a package.</string>
    <key>Identifier</key>
    <string>ch.edu-vd.cipeo.pkg.AdobeReaderDC</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeReaderDC</string>
    </dict>
    <key>ParentRecipe</key>
    <string>ch.edu-vd.cipeo.download.AdobeReaderDC</string>
    <key>Process</key>
    <array>
		<dict>
				<key>Arguments</key>
				<dict>
					<key>dmg_path</key>
					<string>%pathname%</string>
				</dict>
				<key>Processor</key>
				<string>AdobeReaderRepackager</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileFinder</string>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/*/application.pkg</string>
				</dict>
				<key>Comment</key>
				<string>Locates file path of installer package.</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkg_payload_path</key>
					<string>%found_filename%/Payload</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileFinder</string>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/*.app</string>
				</dict>
				<key>Comment</key>
				<string>Locates file path of app bundle.</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Versioner</string>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%found_filename%/Contents/Info.plist</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%found_filename%</string>
					</array>
				</dict>
			</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.adrienpi.SharedProcessors/GetUserHome</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/%app_name%</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/%app_name%</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>new_package_request == FALSE</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
		<dict>
        	<key>Processor</key>
        	<string>Copier</string>
        	<key>Arguments</key>
        	<dict>
				<key>source_path</key>
				<string>%pkg_path%</string>
				<key>destination_path</key>
				<string>/Users/%current_user%/Desktop/packagesupload/</string>
			</dict>
		</dict>
		<dict>
        	<key>Processor</key>
        	<string>com.github.adrienpi.SharedProcessors/CSVWriter</string>
        	<key>Arguments</key>
        	<dict>
				<key>app_name</key>
				<string>%NAME%-%version%.pkg</string>
				<key>app_version</key>
				<string>%version%</string>
				<key>category</key>
				<string>Navigateur</string>
				<key>softwaretitle_name</key>
				<string>Google Chrome</string>
			</dict>
		</dict>
		<dict>
        	<key>Processor</key>
        	<string>Copier</string>
        	<key>Arguments</key>
        	<dict>
				<key>source_path</key>
				<string>%pkg_path%</string>
				<key>destination_path</key>
				<string>/Users/%current_user%/Desktop/packagesupload/</string>
			</dict>
		</dict>
		<dict>
        	<key>Processor</key>
        	<string>com.github.adrienpi.SharedProcessors/CSVWriter</string>
        	<key>Arguments</key>
        	<dict>
				<key>app_name</key>
				<string>%NAME%-latest.pkg</string>
				<key>app_version</key>
				<string>%version%</string>
				<key>category</key>
				<string>Navigateur</string>
				<key>softwaretitle_name</key>
				<string>Google Chrome</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.adrienpi.SharedProcessors/TeamsNotification</string>
			<key>Arguments</key>
			<dict>
				<key>webhook_url</key>
				<string>https://eduvd.webhook.office.com/webhookb2/f598187a-f841-4681-80a8-05efff1db653@eb604481-2c81-4bbe-a1ca-94ba812a78d0/IncomingWebhook/18a2c28c8e10499193a061050434569b/4748d0f8-2b4a-4790-9253-8990250b7d1f</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>
