<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Adobe Reader DC disk image and builds a package.</string>
    <key>Identifier</key>
    <string>ch.edu-vd.cipeo.pkg.AdobeReaderDC</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeReaderDC</string>
        <key>VERSIONTYPE</key>
        <string>CFBundleShortVersionString</string>
    </dict>
    <key>ParentRecipe</key>
    <string>ch.edu-vd.cipeo.download.AdobeReaderDC</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>com.github.adrienpi.SharedProcessors/GetUserHome</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%/*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/application.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/version_check</string>
            </dict>
        </dict>                    
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/version_check/Adobe Acrobat Reader.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>%VERSIONTYPE%</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>com.github.adrienpi.SharedProcessors/VersionCheck</string>
			<key>Arguments</key>
			<dict>
			    <key>version</key>
			    <string>%version%</string>
			    <key>pkg_path</key>
			    <string>%RECIPE_CACHE_DIR%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PlistReader</string>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
			    <string>%RECIPE_CACHE_DIR%/version_check/Adobe Acrobat Reader.app/Contents/Info.plist</string>
			    <key>plist_keys</key>
			    <dict>
			        <key>CFBundleIdentifier</key>
			        <string>bundle_identifier</string>
					<key>LSMinimumSystemVersion</key>
					<string>minimum_version</string>
				</dict>
			</dict>
		</dict>
        <dict>
			<key>Arguments</key>
			<dict>
	            <key>path_list</key>
	            <array>
	                <string>%RECIPE_CACHE_DIR%/unpack</string>
	                <string>%RECIPE_CACHE_DIR%/version_check</string>
	            </array>
	        </dict>
        <key>Processor</key>
        <string>PathDeleter</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>version_exists == True</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/*.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
		<dict>
        	<key>Processor</key>
        	<string>Copier</string>
        	<key>Arguments</key>
        	<dict>
				<key>source_path</key>
				<string>%pkg_path%</string>
				<key>destination_path</key>
				<string>/Users/%current_user%/Desktop/packagesupload/</string>
			</dict>
		</dict>
		<dict>
        	<key>Processor</key>
        	<string>com.github.adrienpi.SharedProcessors/CSVWriter_titleeditor</string>
        	<key>Arguments</key>
        	<dict>
				<key>app_name</key>
				<string>%NAME%-%version%.pkg</string>
				<key>app_version</key>
				<string>%version%</string>
				<key>category</key>
				<string>Bureautique</string>
				<key>softwaretitle_name</key>
				<string>Adobe Acrobat Reader DC Continuous</string>
				<key>app_minimum_version</key>
				<string>%minimum_version%</string>
				<key>bundle_identifier</key>
				<string>%bundle_identifier%</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/*.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-latest.pkg</string>
            </dict>
        </dict>
		<dict>
        	<key>Processor</key>
        	<string>Copier</string>
        	<key>Arguments</key>
        	<dict>
				<key>source_path</key>
				<string>%pkg_path%</string>
				<key>destination_path</key>
				<string>/Users/%current_user%/Desktop/packagesupload/</string>
			</dict>
		</dict>
		<dict>
        	<key>Processor</key>
        	<string>com.github.adrienpi.SharedProcessors/CSVWriter_titleeditor</string>
        	<key>Arguments</key>
        	<dict>
				<key>app_name</key>
				<string>%NAME%-latest.pkg</string>
				<key>app_version</key>
				<string>%version%</string>
				<key>category</key>
				<string>Bureautique</string>
				<key>softwaretitle_name</key>
				<string>Adobe Acrobat Reader DC Continuous</string>
				<key>app_minimum_version</key>
				<string>%minimum_version%</string>
				<key>bundle_identifier</key>
				<string>%bundle_identifier%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.adrienpi.SharedProcessors/TeamsNotification</string>
			<key>Arguments</key>
			<dict>
				<key>webhook_url</key>
				<string>https://eduvd.webhook.office.com/webhookb2/f598187a-f841-4681-80a8-05efff1db653@eb604481-2c81-4bbe-a1ca-94ba812a78d0/IncomingWebhook/18a2c28c8e10499193a061050434569b/4748d0f8-2b4a-4790-9253-8990250b7d1f</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>
