<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Google Chrome disk image and builds a package.</string>
    <key>Identifier</key>
    <string>ch.edu-vd.cipeo.GoogleChrome.pkg</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoogleChrome</string>
    </dict>
    <key>ParentRecipe</key>
    <string>ch.edu-vd.cipeo.GoogleChrome.download</string>
    <key>Process</key>
    <array>
	<dict>
		<key>Processor</key>
		<string>com.github.adrienpi.SharedProcessors/GetUserHome</string>
	</dict>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/%app_name%</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/%app_name%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>new_package_request == FALSE</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
		<dict>
        	<key>Processor</key>
        	<string>Copier</string>
        	<key>Arguments</key>
        	<dict>
				<key>source_path</key>
				<string>%pkg_path%</string>
				<key>destination_path</key>
				<string>/Users/%current_user%/Desktop/packagesupload/</string>
			</dict>
		</dict>
		<dict>
        	<key>Processor</key>
        	<string>com.github.adrienpi.SharedProcessors/CSVWriter</string>
        	<key>Arguments</key>
        	<dict>
				<key>app_name</key>
				<string>%NAME%-%version%.pkg</string>
				<key>app_version</key>
				<string>%version%</string>
				<key>category</key>
				<string>Navigateur</string>
				<key>softwaretitle_name</key>
				<string>Google Chrome</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-latest</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
		<dict>
        	<key>Processor</key>
        	<string>Copier</string>
        	<key>Arguments</key>
        	<dict>
				<key>source_path</key>
				<string>%pkg_path%</string>
				<key>destination_path</key>
				<string>/Users/%current_user%/Desktop/packagesupload/</string>
			</dict>
		</dict>
		<dict>
        	<key>Processor</key>
        	<string>com.github.adrienpi.SharedProcessors/CSVWriter</string>
        	<key>Arguments</key>
        	<dict>
				<key>app_name</key>
				<string>%NAME%-latest.pkg</string>
				<key>app_version</key>
				<string>%version%</string>
				<key>category</key>
				<string>Navigateur</string>
				<key>softwaretitle_name</key>
				<string>Google Chrome</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>TeamsNotification</string>
			<key>Arguments</key>
			<dict>
				<key>webhook_url</key>
				<string>https://eduvd.webhook.office.com/webhookb2/f598187a-f841-4681-80a8-05efff1db653@eb604481-2c81-4bbe-a1ca-94ba812a78d0/IncomingWebhook/18a2c28c8e10499193a061050434569b/4748d0f8-2b4a-4790-9253-8990250b7d1f</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>
